Revit 2027 API
ParameterTypeId.GraphicDisplayOptionsLighting Property
 "Lighting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GraphicDisplayOptionsLighting { get; }
Public Shared ReadOnly Property GraphicDisplayOptionsLighting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GraphicDisplayOptionsLighting {
	ForgeTypeId^ get ();
}
static member GraphicDisplayOptionsLighting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace